In [35]:
import pandas as pd

df = pd.read_csv('input_1.txt', header = None)
df.columns =['values']
df[['list1', 'list2']] = df['values'].str.split(expand = True)

In [47]:
df

            values  list1  list2
0    38450   56790  38450  56790
1    94765   36795  94765  36795
2    89694   26251  89694  26251
3    96083   99006  96083  99006
4    57068   30577  57068  30577
..             ...    ...    ...
995  23906   61328  23906  61328
996  57479   72207  57479  72207
997  37900   90011  37900  90011
998  25566   23322  25566  23322
999  22377   46878  22377  46878

[1000 rows x 3 columns]

In [43]:
list1 = df['list1'].values.tolist()
list2 = df['list2'].values.tolist()
list1 = [int(val) for val in list1]
list2 = [int(val) for val in list2]

In [44]:
sorted_list1 = sorted(list1)
sorted_list2 = sorted(list2)
sum([abs(val1 - val2) for val1, val2 in zip(sorted_list1, sorted_list2)])

1666427

In [46]:
from collections import Counter
counter = Counter(list2)
similarity_score = 0
for x in list1:
    if x in list2:
        similarity_score += x*counter[x]
similarity_score

24316233